Option Explicit

'--------------------------------------------------------------------------------
' ワークシートに関する処理をまとめた標準モジュール
'--------------------------------------------------------------------------------

'--------------------------------------------------------------------------------
' 指定したシートの行数（＝最終行の行番号）を返す。
'
' sheetName: シート名。
' return：シートの行数。
'--------------------------------------------------------------------------------
Public Function GetLastRow(sheetName As String) As Long
    GetLastColumn = 0
End Function

'--------------------------------------------------------------------------------
' 指定したシートの列数（＝最終列の列番号）を返す。
'
' sheetName: シート名。
' return：シートの列数。
'--------------------------------------------------------------------------------
Public Function GetLastColumn(sheetName As String) As Long
    GetLastColumn = 0
End Function
